#include<stdio.h>
// 什么是bug？
// 
// 调试很重要！！！
// 
// 如何写代码？
// 
// 调试的基本步骤：
// 发现程序错误的存在
// 以隔离、消除等方式对错误进行定位
// 确定错误产生的原因
// 提出纠正错误的解决方法
// 对程序错误予以改正，重新测试
// 
// Debug和Release介绍:
// Debug通常称为调试版本，包含各种调试信息，不含各种优化，相对大小较大
// Release称为发布版本，包含各种优化，方便用户使用，相对大小较小

void test()
{
	int a = 10;
	int b = 20;
	int c = a + b;
}
int main()
{
	int arr[10] = { 0 };
	int sz = sizeof(arr) / sizeof(arr[0]);
	
	int i = 0;
	for (i = 0; i < sz; i++)
	{
		arr[i] = i + 1;
		test();
		printf("%d\n", arr[i]);
	}
	return 0;
}
// 
// windows环境调试介绍
// （linux开发环境调试工具是gdb）
// 1.调试环境的准备
// 2.学会快捷键
// 逐语句：可以进到函数内部
// 逐过程：一步一步
// 3.调试的时候查看程序当前信息
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 